In [1]:
import pickle
with open('knn_model.pickle','rb') as f :
    KNN_new = pickle.load(f)

In [4]:

with open('Scaller.pickle','rb') as f :
    Scaller_new = pickle.load(f)

In [6]:
import pandas as pd 
import numpy as np

In [9]:
new_df = pd.read_csv('new_customers.csv')

In [13]:
new_df.head()

   Gender  Age  Salary  Product ID  Price
0    Male   24   38652           3   4446
1  Female   47   64727           1   5188
2    Male   46   54648           1   6193
3    Male   31   20018           3   4779
4    Male   58   77731           2   6855

In [15]:
new_df.drop("Product ID",axis=1,inplace=True)

In [11]:
gender_encouded_new = pd.get_dummies(new_df['Gender'],drop_first=True)

In [20]:
new_df = new_df.join(gender_encouded_new)

In [17]:
new_df.drop("Gender",axis=1,inplace=True)

In [21]:
new_df

   Age  Salary  Price  Male
0   24   38652   4446     1
1   47   64727   5188     0
2   46   54648   6193     1
3   31   20018   4779     1
4   58   77731   6855     1
5   28   55478   6153     1
6   48   54211   7588     0
7   31   60076   5238     1
8   42   29290   5418     0
9   50   21445   5598     1

In [26]:
x_new = new_df[['Age', 'Salary', 'Price','Male']]

In [27]:
x_new_scala2 = Scaller_new.fit_transform(x_new)

In [29]:
y_new_predict = KNN_new.predict(x_new_scala2)

In [44]:
predictionss = pd.DataFrame(y_new_predict)

In [39]:
new_df["prediction"] = y_new_predict

In [46]:
new_df

   Age  Salary  Price  Male  prediction
0   24   38652   4446     1           0
1   47   64727   5188     0           1
2   46   54648   6193     1           1
3   31   20018   4779     1           0
4   58   77731   6855     1           0
5   28   55478   6153     1           1
6   48   54211   7588     0           0
7   31   60076   5238     1           1
8   42   29290   5418     0           0
9   50   21445   5598     1           0

In [47]:
new_df.to_csv("model_prediction.csv",index=False)